from fastapi import FastAPI
from pydantic import BaseModel
from nltk.chat.util import Chat
from fastapi.middleware.cors import CORSMiddleware

# قاعدة البيانات للردود
responses = [
    [
        r"(.*)مرحبا(.*)",
        ["أهلا وسهلا , كيف أقدر أساعدك؟"],
    ],
    [
        r"(.*)سلام(.*)",
        ["وعليكم السلام ورحمة الله وبركاته، كيف أقدر أساعدك؟"],
    ],
    [
        r"(.*)من أنت(.*)",
        ["أنا شذى، هنا عشان أساعدك في الرد على المصطلحات العامية. اكتب أي مصطلح وأنا رح أقدم لك الرد المناسب"]
    ],
    [
        r"(.*)على خشمي(.*)",
        ["عليه الطيب"]
    ],
    [
        r"(.*)حياك الله(.*)",
        ["الله يحيك ويبقيك أو الله يسلمك"]
    ],
    [
        r"(.*)(امري|امر|تامري|تحت امرك)(.*)",
        ["ما يامر عليك عدو أو تسلم يالغالي"]
    ],
    [
        r"(.*)جمعة طيبه(.*)",
        ["ما يامر عليك عدو أو طبت وطاب حالك"]
    ],
    [
        r"(.*)(فديتك|فداك|فدا|فدوه)(.*)",
        ["يفداك الكون كله يا الغالي"]
    ],
    [
        r"(.*)(النعم|انعم)(.*)",
        ["ما عليك زود أو النعم بحالك"]
    ],
    [
        r"(.*)سم(.*)",
        ["سم الله عدوك"]
    ],
    [
        r"(.*)ما تشوف شر(.*)",
        ["الشر ما يجيك"]
    ],
    [
        r"(.*)أرحب(.*)",
        ["الله يسلمك ويسعدك أو الله يرفع قدرك ويحييك"]
    ],
    [
        r"(.*)بشر(.*)",
        ["الله يبشرك بكل خير"]
    ],
    [
        r"(.*)(عز الله مقامك|عز الله قيامك)(.*)",
        ["مقام عزيز"]
    ],
    [
        r"(.*)لاهنت(.*)",
        ["ولا تهون"]
    ],
    [
        r"(.*)عسى ماخلاف(.*)",
        ["الله يسلمك، كل شيء على ما يرام"]
    ],
    [
        r"(.*)ماجور(.*)",
        ["سلمت"]
    ],
    [
        r"(.*)(الله يكرمك|كرمت|اكرم)(.*)",
        ["سلمت ودمت أو ان كان بعد وجبة طعام ممكن ترد: بالعافية"]
    ],
    [
        r"(.*)(الله يتقبل|تقبل الله)(.*)",
        ["منا ومنك"]
    ],
    [
        r"(.*)تشرفنا(.*)",
        ["الشرف لي الله يسعدك"]
    ],
    [
        r"(.*)",  # النمط الافتراضي لعدم العثور على رد
        ["لم أفهم، هل يمكنك إعادة صياغة سؤالك؟"]
    ]
]


# تعريف الشات بوت
class CustomChat(Chat):
    def respond(self, statement):
        # إضافة كلمة "أنت" قبل إدخال المستخدم و"شذى" قبل الرد
        print(f"أنت: {statement}")
        response = super().respond(statement)
        return f"شذى: {response}" 

# إنشاء الشات بوت
chat = CustomChat(responses)

app=FastAPI()

app.add_middleware(
    CORSMiddleware,
    allow_origins=["*"],  # يسمح لجميع المصادر
    allow_credentials=True,
    allow_methods=["*"],  # يسمح بجميع الطرق (GET, POST، إلخ)
    allow_headers=["*"],  # يسمح بجميع الرؤوس
)

# تعريف نموذج الإدخال
class Message(BaseModel):
    text: str

@app.post("/Arabic_Chatbot/")
def get_response(message: Message):
    try:
        user_input = message.text
        bot_response = chat.respond(user_input)
        return {"response": bot_response}
    except Exception as e:
        return {"response": f"حدث خطأ: {str(e)}"}


@app.get("/")
def read_root():
    return {"message": "أهلاً وسهلاً! أنا شذى، الصديقة الذكية اللي هنا عشان تنقذك في كل مرة تكون فيها محتار كيف ترد على المصطلحات العامية. إذا احتجت لأي مساعدة، فقط اكتب لي وسأكون هنا لأساعدك بأفضل ما عندي. 😊"}
